test/Lagrangian/transfers/constant/compressibleVoF/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/compressibleVoF";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

droplets
{
    type        dynamicParcelCloud;
    libs        ("libLagrangianCloud.so");
    phase       water;
    carrierPhase air;
}

// ************************************************************************* //
